In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['shhaurya' , 'shivaan' , 'kabir'],
    "marks":[92,34,24],
    "city":['rampur', 'kolkata' , 'bareilly']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

       name  marks      city
0  shhaurya     92    rampur
1   shivaan     34   kolkata
2     kabir     24  bareilly

In [5]:
df.to_csv('friends.csv')

In [6]:
df.tail(2)

      name  marks      city
1  shivaan     34   kolkata
2    kabir     24  bareilly

In [7]:
df.head(2)

       name  marks     city
0  shhaurya     92   rampur
1   shivaan     34  kolkata

In [8]:
df.describe()

          marks
count   3.00000
mean   50.00000
std    36.71512
min    24.00000
25%    29.00000
50%    34.00000
75%    63.00000
max    92.00000

In [9]:
train = pd.read_csv('train.csv')

In [10]:
train

   Train no.  speed      city
0      11232     45    rampur
1      12534     34   kolkata
2      92847     24  bareilly
3      15893     50   banaras

In [11]:
train['speed']

0    45
1    34
2    24
3    50
Name: speed, dtype: int64

In [12]:
train['city']

0      rampur
1     kolkata
2    bareilly
3     banaras
Name: city, dtype: object

In [13]:
train['speed'][1]

34

In [14]:
train['speed'][1] = 50

C:\Users\Dell\AppData\Local\Temp\ipykernel_31844\3063939717.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['speed'][1] = 50

In [15]:
train['speed'][1]

50

In [16]:
train.to_csv('train1.csv')

In [17]:
train.index = ['f' , 's' , 't' , 'fo']

In [18]:
train

    Train no.  speed      city
f       11232     45    rampur
s       12534     50   kolkata
t       92847     24  bareilly
fo      15893     50   banaras

In [21]:
series = pd.Series(np.random.rand(34))

In [22]:
series

0     0.918693
1     0.487917
2     0.378408
3     0.115389
4     0.243255
5     0.837434
6     0.643928
7     0.833985
8     0.814412
9     0.981900
10    0.793211
11    0.429837
12    0.382218
13    0.681222
14    0.073780
15    0.065004
16    0.613032
17    0.081361
18    0.472566
19    0.787503
20    0.131949
21    0.672737
22    0.103079
23    0.487781
24    0.341549
25    0.953664
26    0.293267
27    0.586302
28    0.088333
29    0.161569
30    0.062515
31    0.955265
32    0.733924
33    0.485052
dtype: float64

In [23]:
type(series)

pandas.core.series.Series

In [48]:
df1 = pd.DataFrame(np.random.rand(8,5), index = np.arange(8))

In [49]:
df1

          0         1         2         3         4
0  0.071554  0.504856  0.229940  0.278598  0.352589
1  0.499355  0.132597  0.025128  0.768851  0.509203
2  0.650709  0.736849  0.391800  0.104616  0.746906
3  0.599674  0.570605  0.221078  0.321030  0.623730
4  0.213762  0.934910  0.009412  0.332479  0.686547
5  0.986263  0.067386  0.449672  0.577783  0.732424
6  0.021590  0.614747  0.186360  0.550621  0.342377
7  0.389093  0.529743  0.247994  0.883347  0.817255

In [50]:
type(df1)

pandas.core.frame.DataFrame

In [51]:
 df1[0][0] = 1

In [52]:
df1

          0         1         2         3         4
0  1.000000  0.504856  0.229940  0.278598  0.352589
1  0.499355  0.132597  0.025128  0.768851  0.509203
2  0.650709  0.736849  0.391800  0.104616  0.746906
3  0.599674  0.570605  0.221078  0.321030  0.623730
4  0.213762  0.934910  0.009412  0.332479  0.686547
5  0.986263  0.067386  0.449672  0.577783  0.732424
6  0.021590  0.614747  0.186360  0.550621  0.342377
7  0.389093  0.529743  0.247994  0.883347  0.817255

In [54]:
df1[0][1] = 'harry'

In [55]:
df1

          0         1         2         3         4
0       1.0  0.504856  0.229940  0.278598  0.352589
1     harry  0.132597  0.025128  0.768851  0.509203
2  0.650709  0.736849  0.391800  0.104616  0.746906
3  0.599674  0.570605  0.221078  0.321030  0.623730
4  0.213762  0.934910  0.009412  0.332479  0.686547
5  0.986263  0.067386  0.449672  0.577783  0.732424
6   0.02159  0.614747  0.186360  0.550621  0.342377
7  0.389093  0.529743  0.247994  0.883347  0.817255

In [56]:
type(df1[0][1])

str

In [57]:
df1.index

Index([0, 1, 2, 3, 4, 5, 6, 7], dtype='int32')

In [58]:
df1.columns

RangeIndex(start=0, stop=5, step=1)

In [59]:
df1.to_numpy()

array([[1.0, 0.5048556673401294, 0.2299396012772923, 0.2785984249256305,
        0.35258890041426605],
       ['harry', 0.13259686475226917, 0.025127773843339973,
        0.7688505047112801, 0.5092027725417463],
       [0.6507086384515384, 0.7368485339888056, 0.39180007420746177,
        0.1046158651912128, 0.7469060452334403],
       [0.5996737368657717, 0.5706053490304726, 0.22107804431454758,
        0.3210300283016415, 0.6237303412521551],
       [0.21376207521906854, 0.9349095743840243, 0.009412216001088214,
        0.3324785502677161, 0.6865474256826809],
       [0.9862634137226306, 0.06738609153402242, 0.44967198838242173,
        0.5777831462447393, 0.7324243673184121],
       [0.021589942775057658, 0.6147472213357408, 0.18635992042741967,
        0.5506206061242186, 0.3423772560044739],
       [0.3890930848038624, 0.5297427873868451, 0.2479938747706114,
        0.8833468369206519, 0.8172549087074581]], dtype=object)

In [60]:
df1[0][1] = 2

In [61]:
df1

          0         1         2         3         4
0       1.0  0.504856  0.229940  0.278598  0.352589
1         2  0.132597  0.025128  0.768851  0.509203
2  0.650709  0.736849  0.391800  0.104616  0.746906
3  0.599674  0.570605  0.221078  0.321030  0.623730
4  0.213762  0.934910  0.009412  0.332479  0.686547
5  0.986263  0.067386  0.449672  0.577783  0.732424
6   0.02159  0.614747  0.186360  0.550621  0.342377
7  0.389093  0.529743  0.247994  0.883347  0.817255

In [62]:
df1.to_numpy()

array([[1.0, 0.5048556673401294, 0.2299396012772923, 0.2785984249256305,
        0.35258890041426605],
       [2, 0.13259686475226917, 0.025127773843339973, 0.7688505047112801,
        0.5092027725417463],
       [0.6507086384515384, 0.7368485339888056, 0.39180007420746177,
        0.1046158651912128, 0.7469060452334403],
       [0.5996737368657717, 0.5706053490304726, 0.22107804431454758,
        0.3210300283016415, 0.6237303412521551],
       [0.21376207521906854, 0.9349095743840243, 0.009412216001088214,
        0.3324785502677161, 0.6865474256826809],
       [0.9862634137226306, 0.06738609153402242, 0.44967198838242173,
        0.5777831462447393, 0.7324243673184121],
       [0.021589942775057658, 0.6147472213357408, 0.18635992042741967,
        0.5506206061242186, 0.3423772560044739],
       [0.3890930848038624, 0.5297427873868451, 0.2479938747706114,
        0.8833468369206519, 0.8172549087074581]], dtype=object)

In [63]:
df1.T

,0,1,2,3,4,5,6,7
0,1.0,2,0.650709,0.599674,0.213762,0.986263,0.02159,0.389093
1,0.504856,0.132597,0.736849,0.570605,0.93491,0.067386,0.614747,0.529743
2,0.22994,0.025128,0.3918,0.221078,0.009412,0.449672,0.18636,0.247994
3,0.278598,0.768851,0.104616,0.32103,0.332479,0.577783,0.550621,0.883347
4,0.352589,0.509203,0.746906,0.62373,0.686547,0.732424,0.342377,0.817255

In [65]:
df1.sort_index(axis = 1, ascending=False)## here axis = 0 is for row and axis = 1 is for columns and by default the ascending is true.

          4         3         2         1         0
0  0.352589  0.278598  0.229940  0.504856       1.0
1  0.509203  0.768851  0.025128  0.132597         2
2  0.746906  0.104616  0.391800  0.736849  0.650709
3  0.623730  0.321030  0.221078  0.570605  0.599674
4  0.686547  0.332479  0.009412  0.934910  0.213762
5  0.732424  0.577783  0.449672  0.067386  0.986263
6  0.342377  0.550621  0.186360  0.614747   0.02159
7  0.817255  0.883347  0.247994  0.529743  0.389093

In [66]:
df1.head()

          0         1         2         3         4
0       1.0  0.504856  0.229940  0.278598  0.352589
1         2  0.132597  0.025128  0.768851  0.509203
2  0.650709  0.736849  0.391800  0.104616  0.746906
3  0.599674  0.570605  0.221078  0.321030  0.623730
4  0.213762  0.934910  0.009412  0.332479  0.686547

In [69]:
type(df1[1])##since it is taken from a dataframe it is proved that dataframe is made from the combinaiton of the series.

pandas.core.series.Series

In [70]:
## to copy a dataset we can use a name with name[:] or we can use name.copy() function to copy a data set if we use a equal to operator then if we make changes in the original dataset thenn the copies dataset will also be changed

In [71]:
#for the chaining of the location for example df1[0][0] then this can create a location error in bigdata so instead we use loc function

In [82]:
df1.loc[1,2] = 100

In [83]:
df1

          0           1           2         3         4
0       1.0  100.000000    0.229940  0.278598  0.352589
1       100  100.000000  100.000000  0.768851  0.509203
2  0.650709    0.736849    0.391800  0.104616  0.746906
3  0.599674    0.570605    0.221078  0.321030  0.623730
4  0.213762    0.934910    0.009412  0.332479  0.686547
5  0.986263    0.067386    0.449672  0.577783  0.732424
6   0.02159    0.614747    0.186360  0.550621  0.342377
7  0.389093    0.529743    0.247994  0.883347  0.817255

In [84]:
df1.columns = list("ABCDE")

In [85]:
df1

          A           B           C         D         E
0       1.0  100.000000    0.229940  0.278598  0.352589
1       100  100.000000  100.000000  0.768851  0.509203
2  0.650709    0.736849    0.391800  0.104616  0.746906
3  0.599674    0.570605    0.221078  0.321030  0.623730
4  0.213762    0.934910    0.009412  0.332479  0.686547
5  0.986263    0.067386    0.449672  0.577783  0.732424
6   0.02159    0.614747    0.186360  0.550621  0.342377
7  0.389093    0.529743    0.247994  0.883347  0.817255

In [88]:
df1.loc[0 , 0] = 654453

In [89]:
df1

          A           B           C         D         E         0
0    654453  100.000000    0.229940  0.278598  0.352589  654453.0
1       100  100.000000  100.000000  0.768851  0.509203       NaN
2  0.650709    0.736849    0.391800  0.104616  0.746906       NaN
3  0.599674    0.570605    0.221078  0.321030  0.623730       NaN
4  0.213762    0.934910    0.009412  0.332479  0.686547       NaN
5  0.986263    0.067386    0.449672  0.577783  0.732424       NaN
6   0.02159    0.614747    0.186360  0.550621  0.342377       NaN
7  0.389093    0.529743    0.247994  0.883347  0.817255       NaN

In [91]:
df1 = df1.drop(0 , axis = 1)

In [92]:
df1

          A           B           C         D         E
0    654453  100.000000    0.229940  0.278598  0.352589
1       100  100.000000  100.000000  0.768851  0.509203
2  0.650709    0.736849    0.391800  0.104616  0.746906
3  0.599674    0.570605    0.221078  0.321030  0.623730
4  0.213762    0.934910    0.009412  0.332479  0.686547
5  0.986263    0.067386    0.449672  0.577783  0.732424
6   0.02159    0.614747    0.186360  0.550621  0.342377
7  0.389093    0.529743    0.247994  0.883347  0.817255

In [97]:
df1.drop('E' , axis = 1)

          A           B           C         D
0    654453  100.000000    0.229940  0.278598
1       100  100.000000  100.000000  0.768851
2  0.650709    0.736849    0.391800  0.104616
3  0.599674    0.570605    0.221078  0.321030
4  0.213762    0.934910    0.009412  0.332479
5  0.986263    0.067386    0.449672  0.577783
6   0.02159    0.614747    0.186360  0.550621
7  0.389093    0.529743    0.247994  0.883347

In [98]:
df1

          A           B           C         D         E
0    654453  100.000000    0.229940  0.278598  0.352589
1       100  100.000000  100.000000  0.768851  0.509203
2  0.650709    0.736849    0.391800  0.104616  0.746906
3  0.599674    0.570605    0.221078  0.321030  0.623730
4  0.213762    0.934910    0.009412  0.332479  0.686547
5  0.986263    0.067386    0.449672  0.577783  0.732424
6   0.02159    0.614747    0.186360  0.550621  0.342377
7  0.389093    0.529743    0.247994  0.883347  0.817255

In [99]:
df1.drop(4 , axis = 0)

          A           B           C         D         E
0    654453  100.000000    0.229940  0.278598  0.352589
1       100  100.000000  100.000000  0.768851  0.509203
2  0.650709    0.736849    0.391800  0.104616  0.746906
3  0.599674    0.570605    0.221078  0.321030  0.623730
5  0.986263    0.067386    0.449672  0.577783  0.732424
6   0.02159    0.614747    0.186360  0.550621  0.342377
7  0.389093    0.529743    0.247994  0.883347  0.817255

In [104]:
df1.drop(4 , axis = 0)

          A           B           C         D         E
0    654453  100.000000    0.229940  0.278598  0.352589
1       100  100.000000  100.000000  0.768851  0.509203
2  0.650709    0.736849    0.391800  0.104616  0.746906
3  0.599674    0.570605    0.221078  0.321030  0.623730
5  0.986263    0.067386    0.449672  0.577783  0.732424
6   0.02159    0.614747    0.186360  0.550621  0.342377
7  0.389093    0.529743    0.247994  0.883347  0.817255

In [106]:
df1.loc[[1,2], ['C', 'D']]

          C         D
1  100.0000  0.768851
2    0.3918  0.104616

In [108]:
df1.loc[:, ['C', 'D']]

            C         D
0    0.229940  0.278598
1  100.000000  0.768851
2    0.391800  0.104616
3    0.221078  0.321030
4    0.009412  0.332479
5    0.449672  0.577783
6    0.186360  0.550621
7    0.247994  0.883347

In [111]:
df1.loc[[1,2], :]

          A           B         C         D         E
1       100  100.000000  100.0000  0.768851  0.509203
2  0.650709    0.736849    0.3918  0.104616  0.746906

In [113]:
df1.loc[(df1['A']<0.3)]

          A         B         C         D         E
4  0.213762  0.934910  0.009412  0.332479  0.686547
6   0.02159  0.614747  0.186360  0.550621  0.342377

In [119]:
df1.loc[(df1['A']<0.3) & (df1['C']>0.1)]

         A         B        C         D         E
6  0.02159  0.614747  0.18636  0.550621  0.342377

In [120]:
df1.iloc[1,3]

0.7688505047112801

In [124]:
df1.iloc[[1,3] , [0,4]]

          A         E
1       100  0.509203
3  0.599674  0.623730

In [125]:
## inplace is value during dropping a row or column is False so that it doesnt affect the original table if we make it true then the change can happen

In [126]:
df1

          A           B           C         D         E
0    654453  100.000000    0.229940  0.278598  0.352589
1       100  100.000000  100.000000  0.768851  0.509203
2  0.650709    0.736849    0.391800  0.104616  0.746906
3  0.599674    0.570605    0.221078  0.321030  0.623730
4  0.213762    0.934910    0.009412  0.332479  0.686547
5  0.986263    0.067386    0.449672  0.577783  0.732424
6   0.02159    0.614747    0.186360  0.550621  0.342377
7  0.389093    0.529743    0.247994  0.883347  0.817255

In [127]:
df1.drop(3)

          A           B           C         D         E
0    654453  100.000000    0.229940  0.278598  0.352589
1       100  100.000000  100.000000  0.768851  0.509203
2  0.650709    0.736849    0.391800  0.104616  0.746906
4  0.213762    0.934910    0.009412  0.332479  0.686547
5  0.986263    0.067386    0.449672  0.577783  0.732424
6   0.02159    0.614747    0.186360  0.550621  0.342377
7  0.389093    0.529743    0.247994  0.883347  0.817255

In [128]:
df1.reset_index()

   index         A           B           C         D         E
0      0    654453  100.000000    0.229940  0.278598  0.352589
1      1       100  100.000000  100.000000  0.768851  0.509203
2      2  0.650709    0.736849    0.391800  0.104616  0.746906
3      3  0.599674    0.570605    0.221078  0.321030  0.623730
4      4  0.213762    0.934910    0.009412  0.332479  0.686547
5      5  0.986263    0.067386    0.449672  0.577783  0.732424
6      6   0.02159    0.614747    0.186360  0.550621  0.342377
7      7  0.389093    0.529743    0.247994  0.883347  0.817255

In [130]:
df1.reset_index(drop = True)

          A           B           C         D         E
0    654453  100.000000    0.229940  0.278598  0.352589
1       100  100.000000  100.000000  0.768851  0.509203
2  0.650709    0.736849    0.391800  0.104616  0.746906
3  0.599674    0.570605    0.221078  0.321030  0.623730
4  0.213762    0.934910    0.009412  0.332479  0.686547
5  0.986263    0.067386    0.449672  0.577783  0.732424
6   0.02159    0.614747    0.186360  0.550621  0.342377
7  0.389093    0.529743    0.247994  0.883347  0.817255

In [131]:
df1['B'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: B, dtype: bool

In [142]:
df1.loc[:,['B']] = 56

In [143]:
df1

          A   B           C         D         E
0    654453  56    0.229940  0.278598  0.352589
1       100  56  100.000000  0.768851  0.509203
2  0.650709  56    0.391800  0.104616  0.746906
3  0.599674  56    0.221078  0.321030  0.623730
4  0.213762  56    0.009412  0.332479  0.686547
5  0.986263  56    0.449672  0.577783  0.732424
6   0.02159  56    0.186360  0.550621  0.342377
7  0.389093  56    0.247994  0.883347  0.817255

In [144]:
df1

          A   B           C         D         E
0    654453  56    0.229940  0.278598  0.352589
1       100  56  100.000000  0.768851  0.509203
2  0.650709  56    0.391800  0.104616  0.746906
3  0.599674  56    0.221078  0.321030  0.623730
4  0.213762  56    0.009412  0.332479  0.686547
5  0.986263  56    0.449672  0.577783  0.732424
6   0.02159  56    0.186360  0.550621  0.342377
7  0.389093  56    0.247994  0.883347  0.817255

In [145]:
df1['B'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: B, dtype: bool

In [180]:
df2 = pd.DataFrame({"name": ['alfred', 'batman', 'alfred'],
                    "toy": [np.nan, 'batmobile', 'bullwhip'],
                    "born": [pd.NaT, pd.Timestamp("1940-04-25"), pd.NaT]})

In [181]:
df2.head()

     name        toy       born
0  alfred        NaN        NaT
1  batman  batmobile 1940-04-25
2  alfred   bullwhip        NaT

In [182]:
df2.dropna()

     name        toy       born
1  batman  batmobile 1940-04-25

In [183]:
df2

     name        toy       born
0  alfred        NaN        NaT
1  batman  batmobile 1940-04-25
2  alfred   bullwhip        NaT

In [184]:
df2.dropna(how = 'all')

     name        toy       born
0  alfred        NaN        NaT
1  batman  batmobile 1940-04-25
2  alfred   bullwhip        NaT

In [186]:
df2.drop_duplicates(subset=['name'])

     name        toy       born
0  alfred        NaN        NaT
1  batman  batmobile 1940-04-25

In [187]:
df2

     name        toy       born
0  alfred        NaN        NaT
1  batman  batmobile 1940-04-25
2  alfred   bullwhip        NaT

In [190]:
df2.drop_duplicates(subset=['name'], keep='first')

     name        toy       born
0  alfred        NaN        NaT
1  batman  batmobile 1940-04-25

In [191]:
df2.drop_duplicates(subset=['name'], keep='last')

     name        toy       born
1  batman  batmobile 1940-04-25
2  alfred   bullwhip        NaT

In [192]:
df1

          A   B           C         D         E
0    654453  56    0.229940  0.278598  0.352589
1       100  56  100.000000  0.768851  0.509203
2  0.650709  56    0.391800  0.104616  0.746906
3  0.599674  56    0.221078  0.321030  0.623730
4  0.213762  56    0.009412  0.332479  0.686547
5  0.986263  56    0.449672  0.577783  0.732424
6   0.02159  56    0.186360  0.550621  0.342377
7  0.389093  56    0.247994  0.883347  0.817255

In [193]:
df1.shape

(8, 5)

In [195]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       8 non-null      object
 1   B       8 non-null      object
 2   C       8 non-null      float64
 3   D       8 non-null      float64
 4   E       8 non-null      float64
dtypes: float64(3), object(2)
memory usage: 588.0+ bytes

In [197]:
df2['toy'].value_counts(dropna = False)

toy
NaN          1
batmobile    1
bullwhip     1
Name: count, dtype: int64

In [198]:
## homework practise

In [202]:
home = pd.DataFrame(np.random.rand(3,2), index = np.arange(3))

In [203]:
home.head()

          0         1
0  0.425868  0.265398
1  0.603738  0.454872
2  0.379884  0.269930

In [204]:
home.describe()

              0         1
count  3.000000  3.000000
mean   0.469830  0.330067
std    0.118225  0.108108
min    0.379884  0.265398
25%    0.402876  0.267664
50%    0.425868  0.269930
75%    0.514803  0.362401
max    0.603738  0.454872

In [205]:
home.mean()

0    0.469830
1    0.330067
dtype: float64

In [206]:
home.corr()

          0         1
0  1.000000  0.976616
1  0.976616  1.000000

In [207]:
home.count()

0    3
1    3
dtype: int64

In [209]:
home.max(axis=1)

0    0.425868
1    0.603738
2    0.379884
dtype: float64

In [210]:
home.min()

0    0.379884
1    0.265398
dtype: float64

In [211]:
home.median()

0    0.425868
1    0.269930
dtype: float64

In [213]:
home.std(axis=1)

0    0.113469
1    0.105265
2    0.077750
dtype: float64

In [223]:
data = pd.read_excel('data.xlsx')

In [224]:
data

   roll no      name    stream
0        1  shhaurya       pcm
1        2   shivaan       pcm
2        3     kabir       pbc
3        4      jojo  commerce
4        5   krishna     human

In [225]:
data2 = pd.read_excel('data.xlsx' , sheet_name = 'Sheet2')

In [226]:
data2

   roll no     name2    stream2
0        1  shhaurya        pbc
1        2   shivaan        pcm
2        3     kabir        pbc
3        4      jojo  kuch nahi
4        5   krishna      human

In [228]:
data2.to_excel('data2.xlsx' , sheet_name='Sheet2')